Repository: turulomio/eml_rename
Catalog: eml_rename/locale/*.po
Languages: es

source: You pressed 'Ctrl+C', exiting...
es: Has pulsado 'Ctrl+C', saliendo...

source: Developed by Mariano Muñoz 2022-{}
es: Desarrollado por Mariano Muñoz 2022-{}

source: Script renames all eml files in a directory using mail metadata
es: Este comando renombra todos los ficheros eml en un directorio usando los metadatos del correo

source: Forces subject update when 'YYYYMMDD HHMM [from]' format is detected
es: Fuerza la modificación del asunto cuando el formato 'YYYYMMDD HHMM [Desde]' es detectado

source: Maximum length allowed to final name using 'YYYYMMDD HHMM [from]'. Default: {0}
es: Máxima longitud permitida al nombre final usando 'YYYYMMDD HHMM [Desde]'. Por defecto: {0}

source: Without this parameter files won't be renamed. Script only pretend the result
es: Sin este parámetro los ficheros no serán renombrados. El comando solo adivina el resultado

source: Use Gemini AI to summarize email content as subject
es: Usa la IA de Gemini para resumir el contenido del correo como asunto

source: Delay between AI requests
es: Retraso entre peticiones de IA

source: Processing eml files
es: Procesando ficheros eml

source: {0} files were renamed.
es: {0} ficheros fueron renombrados.

source: Process was simulated, files weren't renamed. Use --save to rename {0} files.
es: El proceso fue simulado, los ficheros no fueron renombrados. Usa --save para renombrar {0} ficheros.

source: It took {}
es: Tardó {}

source: (Without subject)
es: (sin asunto)

source: Error parsing subject
es: Error al obtener el asunto

source: The 'google-genai' package is not installed. Please run 'pip install google-genai' or 'poetry install'.
es: El paquete 'google-genai' no está instalado. Por favor, ejecuta 'pip install google-genai' o 'poetry install'.

source: GOOGLE_API_KEY not found. Set it in environment or in ~/.config/eml-rename/config.ini
es: GOOGLE_API_KEY no encontrada. Configúrala en el entorno o en ~/.config/eml-rename/config.ini

source: [Error detected. Won't be renamed]
es: [Error detectado. No será renombrado]

source: [Error detected. Not Renamed]
es: [Error detectado. No renombrado]

source: [Will be renamed]
es: [Será renombrado]

source: [Renamed]
es: [Renombrado]

source: [Format detected. Won't de renamed]
es: [Formato detectado. No será renombrado]

source: [Format detected. Not renamed]
es: [Formato detectado. No renombrado]

source: vhs tool is needed. Look at https://github.com/charmbracelet/vhs
es: Se necesita la herramienta vhs. Mira en https://github.com/charmbracelet/vhs
